//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// DACの設定
// 2019.4 sakai created.
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

#ifndef DAC_446_C
#define DAC_446_C

#include "DAC_446.h"

/* main ex
// DAC1,2()
int main(void)
{   
    uint32_t count = 0;
    HSE_PLL_init(); // System Clock:180MHz 
   
    DAC_init();

    while(1){
        DAC1->DHR12R1 = 0xFFF - count;
        DAC1->DHR12R2 = 0xFFF - count;
        DAC1->SWTRIGR = (0b1 << DAC_SWTRIGR_SWTRIG2_Pos) | (0b1 << DAC_SWTRIGR_SWTRIG1_Pos); // 1で有効 アウトプットされるとハードリセット
        count++;
        if(count == 0xFFF){count = 0;}
    };
}
*/

// =====================================================================================================================
//  DAC init
// =====================================================================================================================
void DAC_init(){
    RCC->APB1ENR |= (0b1 << RCC_APB1ENR_DACEN_Pos) ;
    
    GPIOA->MODER |= (0b11 << GPIO_MODER_MODE5_Pos) | (0b11 << GPIO_MODER_MODE4_Pos); 

    DAC1->CR = (0b0 << DAC_CR_DMAUDRIE2_Pos) | /* アンダーラン割り込み有効:1 */
               (0b0 << DAC_CR_DMAEN2_Pos) |/* DMA有効:! */
               (0b0000 << DAC_CR_MAMP2_Pos) | /* 波形生成モードのマスク */
               (0b00 << DAC_CR_WAVE2_Pos) | /* 生成イネーブル */
               (0b111 << DAC_CR_TSEL2_Pos) | /* トリガ選択 000-101:タイマ 110:外部 111:ソフト */
               (0b0 << DAC_CR_TEN2_Pos) | /* 0:トリガは無効でDHRxに書き込まれたデータが書き込まれたあとAPB1の1クロックサイクル後にDOR2レジスタへ送信 1:有効だがAPB1の3クロック後に0と同じ動作*/
               (0b0 << DAC_CR_BOFF2_Pos) | /* 出力バッファ有効:! */
               (0b1 << DAC_CR_EN2_Pos) | /* DAC有効 */
               (0b0 << DAC_CR_DMAUDRIE1_Pos) | /* アンダーラン割り込み有効:1 */ 
               (0b0 << DAC_CR_DMAEN1_Pos) |/* DMA有効:! */ 
               (0b0000 << DAC_CR_MAMP1_Pos) | /* 波形生成モードのマスク */ 
               (0b00 << DAC_CR_WAVE1_Pos) | /* 生成イネーブル */ 
               (0b111 << DAC_CR_TSEL1_Pos) | /* トリガ選択 000-101:タイマ 110:外部 111:ソフト */ 
               (0b0 << DAC_CR_TEN1_Pos) | /* 0:トリガは無効でDHRxに書き込まれたデータが書き込まれたあとAPB1の1クロックサイクル後にDOR2レジスタへ送信 1:有効だがAPB1の3クロック後に0と同じ動作*/ 
               (0b0 << DAC_CR_BOFF1_Pos) | /* 出力バッファ有効:! */ 
               (0b1 << DAC_CR_EN1_Pos) ;/* DAC有効 */ 

// DAC1->DAC_SWTRIGR = (0b0 << DAC_SWTRIGR_SWTRIG2_Pos) | (0b0 << DAC_SWTRIGR_SWTRIG1_Pos); // 1で有効 アウトプットされるとハードリセット
}
// =====================================================================================================================
//  PA4 DA Mode init
// =====================================================================================================================
void DAC_PA4_init(){
	// GPIO A enable
	RCC->AHB1ENR |= (0b1 << RCC_AHB1ENR_GPIOAEN_Pos);
	// PA4 analog mode
	GPIOA->MODER |= (0b11 << GPIO_MODER_MODE4_Pos); 
}
// =====================================================================================================================
//  PA5 DA Mode init
// =====================================================================================================================
void DAC_PA5_init(){
	// GPIO A enable
	RCC->AHB1ENR |= (0b1 << RCC_AHB1ENR_GPIOAEN_Pos);
	// PA4 analog mode
	GPIOA->MODER |= (0b11 << GPIO_MODER_MODE5_Pos); 
}
// =====================================================================================================================
//  Output data 
// =====================================================================================================================
void DAC12_data_u12(uint32_t data){
    DAC1->DHR12R1 = data; //右詰め12bit DAC1 のデータバッファ
    DAC1->DHR12R2 = data; //右詰め12bit DAC2 のデータバッファ
}
// =====================================================================================================================
//  Output Trigger 
// =====================================================================================================================
inline void DAC12_outputTrigger(void){
    DAC1->SWTRIGR = (0b1 << DAC_SWTRIGR_SWTRIG2_Pos) | (0b1 << DAC_SWTRIGR_SWTRIG1_Pos); // 1で有効 アウトプットされるとハードリセット
}
#endif