//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// MIDIの設定
// 2019.2.3 sakai created.
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#ifndef MIDI_BASE_C
#define MIDI_BASE_C

#include "midi_base.h"

void midi_base_init(void){
    PC10_PC11_TXRX_init();
    UART3_init();
}

// =====================================================================================================================
//  UART3 GPIO PC10(Tx) PC11(Rx) setting
// =====================================================================================================================
 void PC10_PC11_TXRX_init() {
    RCC-> AHB1ENR      |= RCC_AHB1ENR_GPIOCEN;         // GPIO-C clock enable from AHB1
    
    GPIOC-> MODER      = 0x00000000;
    GPIOC-> PUPDR      = 0x00000000;            // no pullup pulldown
 
     // PC10 
    GPIOC-> AFR[0]     = 0; 
    GPIOC-> MODER      |= 0x00200000; // PC10の役割設定をオルタネイトに設定
    GPIOC-> PUPDR      |= 0b01 << 20;
    GPIOC-> AFR[1]     |= 0x00000700; //オルタネイトファンクションの種類を設定(0x7=UART3)
    GPIOC->OSPEEDR |= 0b11 << 22;
     // PC11 
    GPIOC-> MODER      |= 0x00800000; // PC10の役割設定をオルタネイトに設定
    GPIOC-> PUPDR      |= 0b01 << 22;
    GPIOC-> AFR[1]     |= 0x00007000; //オルタネイトファンクションの種類を設定(0x7=UART3)
}

// =====================================================================================================================
//  UART3 IRQ and Baud Rate setting
// =====================================================================================================================
void UART3_init() {
     PC10_PC11_TXRX_init();
    // UART3 clock enable from APB1
    RCC-> APB1ENR |=  RCC_APB1ENR_USART3EN; //USART3 enable.
    
    USART3-> BRR = 0x5A << 4; //baud rate
    USART3-> CR1 = 0x0;
    //USART3->CR1 &= ~USART_CR1_OVER8; 
    USART3-> CR1 = USART_CR1_UE | USART_CR1_TE | USART_CR1_RE; //UART通信をenable | Tx enable | Rx enable
    USART3-> CR2 = 0x0;
    USART3-> CR3 = 0x0;

    //USART3_IRQ_enable(); // TXEIE On
    //NVIC_EnableIRQ(USART3_IRQn); // UART3 IRQ enable
    //NVIC_SetPriority(USART3_IRQn, 0); // IRQ Priority setting.

    /*
    F446のAPB1のクロックは45MHzになっている｡(設定をmbedのデフォルトで使えば｡)
    このとき､BRR(U_div)を求める式は､U_div = 45000000 / (16 * BaudRate)
    9.6kHzのとき0x125､31.25kHzのとき0x5Aとなる｡
    */
} 

// =====================================================================================================================
//  UART3 TXEIE enable
// =====================================================================================================================

inline void USART3_IRQ_enable(){
    USART3-> CR1 |= USART_CR1_TXEIE;
}

// =====================================================================================================================
//  UART3 TXEIE disable
// =====================================================================================================================

inline void USART3_IRQ_disable(){
    USART3-> CR1 &= ~USART_CR1_TXEIE;    
}

// =====================================================================================================================
//  char型を一つ送信
// =====================================================================================================================

inline void send_char(char c){
    USART3-> DR = c; 
    while ((USART3->SR & USART_SR_TXE) == 0); //SRのTXEが0のとき､送信データは入力できないので待つ｡
}
// =====================================================================================================================
//  任意長の文字列送信
// =====================================================================================================================

void send_str(const char *str){
    uint8_t p = 0;
	
    while( str[p] != '\0' ) {
		send_char(str[p]);
		p++;
	}
}
// =====================================================================================================================
//  int 型 を一つ送信
// =====================================================================================================================

inline void send_int(int n){
    USART3 -> DR = n;
    USART3-> CR1 |= USART_CR1_TXEIE;    
    //USART3-> CR1 &= ~USART_CR1_TXEIE;    
    //while ((USART3->SR & USART_SR_TXE) == 0); //SRのTXEが0のとき､送信データは入力できないので待つ｡
}
// =====================================================================================================================
//  int 型 を 3つ送信
// =====================================================================================================================

void send_ints3(int n) {
    //send_int( (n >> 24) & 0xFF);
    //USART3->SR |= USART_SR_TXE;
    send_int( (n >> 16) & 0xFF);
    send_int( (n >>  8) & 0xFF);
    send_int( (n >>  0) & 0xFF);
    //USART3->SR |= 0 << 7;

}


// =====================================================================================================================
//  printf
// =====================================================================================================================
inline void UART3_send_char(char c){
	while (!(USART3->SR & USART_SR_TXE)); //SRのTXEが0のとき､送信データは入力できないので待つ｡
    USART3-> DR = c; 
}

void PutcUSART3(char c)
{
    if(c == '\n'){
        UART3_send_char('\r');
    }
    UART3_send_char(c);
}
#endif